apache/nuttx/arch/arm/src/stm32l4/stm32l4_i2c.c
/****************************************************************************
 * arch/arm/src/stm32l4/stm32l4_i2c.c
 *
 * SPDX-License-Identifier: BSD-3-Clause
 * SPDX-FileCopyrightText: 2016-2018 Gregory Nutt. All rights reserved.
 * SPDX-FileCopyrightText: 2011-2013 Gregory Nutt. All rights reserved.
 * SPDX-FileCopyrightText: 2016 Doug Vetter.  All rights reserved.
 * SPDX-FileCopyrightText: 2011 Uros Platise. All rights reserved.
 * SPDX-FileContributor: Uros Platise <uros.platise@isotel.eu>
 * SPDX-FileContributor: Gregory Nutt <gnutt@nuttx.org>
 * SPDX-FileContributor: John Wharington
 * SPDX-FileContributor: David Sidrane <david_s5@nscdg.com>
 * SPDX-FileContributor: Doug Vetter <oss@aileronlabs.com>
 * SPDX-FileContributor: Sebastien Lorquet
 * SPDX-FileContributor: dev@ziggurat29.com
 * SPDX-FileContributor: Jussi Kivilinna <jussi.kivilinna@haltian.com>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/* --------------------------------------------------------------------------
 *
 * STM32 L4 I2C Driver based on STM32 F7 I2C Driver:
 *
 * STM32 L4 and F7 peripheral differences:
 *  - I2C Peripheral on these families are identical (incl. errata) except
 *    for I2C_CR1 register bit 18:
 *      STM32F7: reserved
 *      STM32L4: WUPEN, Wakeup from Stop mode enable. Requires use of HSI
 *               clock for I2C (RCC_CCIPR_I2CxSEL=HSI).
 *
 * Supports:
 *  - Master operation:
 *      Standard-mode (up to 100 kHz)
 *      Fast-mode (up to 400 kHz)
 *      fI2CCLK clock source selection is based on RCC_CCIPR_I2CxSEL
 *      being set to PCLK and the calculations are based on PCLK frequency
 *      of 80 MHz
 *
 *  - Multiple instances (shared bus)
 *  - Interrupt based operation
 *  - RELOAD support
 *  - I2C_M_NOSTART support
 *
 * Test Environment:
 *  - STM32L451CEU6 based board with I2C slaves LIS2DH accelerometer and
 *    BQ24296 charger
 *
 * Supported on STM32F7 driver, untested on STM32L4:
 *  - Master operation:
 *      Fast-mode Plus (up to 1 MHz)
 *  - Test Environment:
 *      STM32F7676ZI on ST Nucleo-144 Board (ST Part STM32F429ZIT6)
 *
 * Unsupported, possible future work:
 *  - Wakeup from Stop mode
 *  - More effective error reporting to higher layers
 *  - Slave operation
 *  - Support of fI2CCLK frequencies other than 80 MHz and other clock
 *    sources
 *  - Polled operation (code present but untested)
 *  - SMBus support
 *  - Multi-master support
 *  - IPMI
 *
 * Operational Status:
 *
 *  All supported features have been tested and found to be operational.
 *
 *  Although the RELOAD capability has been tested as it was required to
 *  implement the I2C_M_NOSTART flag on F3 hardware, the associated
 *  logic to support the transfer messages with more than 255 byte
 *  payloads has not been  tested as the author lacked access to a real
 *  device supporting these types of transfers.
 *
 * Performance Benchmarks: TBD
 *
 *  Time to transfer two messages, each a byte in length, in addition to the
 *  START condition, in interrupt mode:
 *
 *  DEBUG enabled (development): TBDms
 *      Excessive delay here is caused by printing to the console and
 *      is of no concern.
 *
 *  DEBUG disabled (production): TBSus
 *      Between Messages: TBDus
 *      Between Bytes: TBDus
 *
 * Implementation:
 *
 *  - Device: structure as defined by the nuttx/i2c/i2c.h
 *
 *  - Instance: represents each individual access to the I2C driver, obtained
 *      by the i2c_init(); it extends the Device structure from the
 *      nuttx/i2c/i2c.h;
 *      Instance points to OPS, to common I2C Hardware private data and
 *      contains its own private data including frequency, address and mode
 *      of operation.
 *
 *  - Private: Private data of an I2C Hardware
 *
 * High Level Functional Desecription
 *
 * This driver works with I2C "messages" (struct i2c_msg_s), which carry a
 * buffer intended to transfer data to, or store data read from, the I2C bus.
 *
 * As the hardware can only transmit or receive one byte at a time the basic
 * job of the driver (and the ISR specifically) is to process each message in
 * the order they are stored in the message list, one byte at a time.  When
 * no messages are left the ISR exits and returns the result to the caller.
 *
 * The order of the list of I2C messages provided to the driver is important
 * and dependent upon the hardware in use.  A typical I2C transaction between
 * the F3 as an I2C Master and some other IC as a I2C Slave requires two
 * messages that communicate the:
 *
 *    1) Subaddress (register offset on the slave device)
 *    2) Data sent to or read from the device
 *
 * These messages will typically be one byte in length but may be up to 2^31
 * bytes in length.  Incidentally, the maximum length is limited only because
 * i2c_msg_s.length is a signed int for some odd reason.
 *
 * Interrupt mode relies on the following interrupt events:
 *
 *   TXIS  - Transmit interrupt
 *           (data transmitted to bus and acknowledged)
 *   NACKF - Not Acknowledge Received
 *           (data transmitted to bus and NOT acknowledged)
 *   RXNE  - Receive interrupt
 *           (data received from bus)
 *   TC    - Transfer Complete
 *           (All bytes in message transferred)
 *   TCR   - Transfer Complete (Reload)
 *           (Current batch of bytes in message transferred)
 *
 * The driver currently supports Single Master mode only.  Slave mode is not
 * supported.  Additionally, the driver runs in Software End Mode (AUTOEND
 * disabled) so the driver is responsible for telling the hardware what to
 * do at the end of a transfer.
 *
 * --------------------------------------------------------------------------
 *
 * Configuration:
 *
 *  To use this driver, enable the following configuration variable:
 *
 *    CONFIG_STM32L4_I2C
 *
 *  and one or more interfaces:
 *
 *    CONFIG_STM32L4_I2C1
 *    CONFIG_STM32L4_I2C2
 *    CONFIG_STM32L4_I2C3
 *    CONFIG_STM32L4_I2C4
 *
 *  To configure the ISR timeout using fixed values
 * (CONFIG_STM32L4_I2C_DYNTIMEO=n):
 *
 *    CONFIG_STM32L4_I2CTIMEOSEC   (Timeout in seconds)
 *    CONFIG_STM32L4_I2CTIMEOMS    (Timeout in milliseconds)
 *    CONFIG_STM32L4_I2CTIMEOTICKS (Timeout in ticks)
 *
 *  To configure the ISR timeout using dynamic values
 * (CONFIG_STM32L4_I2C_DYNTIMEO=y):
 *
 *    CONFIG_STM32L4_I2C_DYNTIMEO_USECPERBYTE
 *                    (Timeout in microseconds per byte)
 *    CONFIG_STM32L4_I2C_DYNTIMEO_STARTSTOP
 *                    (Timeout for start/stop inmilliseconds)
 *
 *  Debugging output enabled with:
 *
 *    CONFIG_DEBUG_FEATURES and CONFIG_DEBUG_I2C_{ERROR|WARN|INFO}
 *
 *  ISR Debugging output may be enabled with:
 *
 *    CONFIG_DEBUG_FEATURES and CONFIG_DEBUG_I2C_INFO
 *
 * --------------------------------------------------------------------------
 *
 * References (STM32F7):
 *
 *  RM0316:
 *     ST STM32F76xxx and STM32F77xxx Reference Manual
 *     Document ID: DocID028270 Revision 2, April 2016.
 *
 *  DATASHEET:
 *     ST STM32F777xx/STM32F778Ax/STM32F779x Datasheet
 *     Document ID: DocID028294, Revision 3, May 2016.
 *
 *  ERRATA:
 *     STM32F76xxx/STM32F77xxx Errata sheet Rev A device limitations
 *     Document ID: DocID028806, Revision 2, April 2016.
 *
 *  I2CSPEC:
 *     I2C Bus Specification and User Manual
 *     Document ID: UM10204, Revision 6, April 2014.
 *
 * References (STM32L4):
 *
 *  RM0394:
 *     ST STM32L43xxx STM32L44xxx STM32L45xxx STM32L46xxx Reference Manual
 *     Document ID: DocID027295, Revision 3, April 2017.
 *
 *  ERRATA:
 *     STM32L451xx Errata sheet device limitations
 *     Document ID: DocID030061, Revision 4, September 2017.
 *
 * --------------------------------------------------------------------------
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

