apache/nuttx/arch/arm/src/stm32l4/stm32l4_i2c.c
          /*  The Speed and timing calculation are based on the following
           *  fI2CCLK = PCLK and is 80 MHz
           *  Analog filter is on,
           *  Digital filter off
           *  Rise Time is 120 ns and fall is 10 ns
           *  Mode is FastMode
           */

          if (frequency == 100000)
            {
              /* 100 KHz values from I2C timing tool with clock 80 MHz */

              presc        = 0x01;    /* PRESC - (+1) prescale I2CCLK */
              scl_l_period = 0xe7;    /* SCLL - SCL low period in master mode */
              scl_h_period = 0x9b;    /* SCLH - SCL high period in master mode */
              sda_delay    = 0x00;    /* SDADEL - (+1) data hold time after SCL falling edge */
              scl_delay    = 0x0d;    /* SCLDEL - (+1) data setup time from SDA edge to SCL rising edge */
            }
          else if (frequency == 400000)
            {
              /* 400 KHz values from I2C timing tool for clock of 80 MHz */

              presc        = 0x01;    /* PRESC - (+1) prescale I2CCLK */
              scl_l_period = 0x43;    /* SCLL - SCL low period in master mode */
              scl_h_period = 0x13;    /* SCLH - SCL high period in master mode */
              sda_delay    = 0x00;    /* SDADEL - (+1) data hold time after SCL falling edge */
              scl_delay    = 0x07;    /* SCLDEL - (+1) data setup time from SDA edge to SCL rising edge */
            }
          else if (frequency == 1000000)
            {
              /* 1000 KHz values from I2C timing tool for clock of 80 MHz */

              presc        = 0x01;    /* PRESC - (+1) prescale I2CCLK */
              scl_l_period = 0x14;    /* SCLL - SCL low period in master mode */
              scl_h_period = 0x13;    /* SCLH - SCL high period in master mode */
              sda_delay    = 0x00;    /* SDADEL - (+1) data hold time after SCL falling edge */
              scl_delay    = 0x05;    /* SCLDEL - (+1) data setup time from SDA edge to SCL rising edge */
            }
          else
            {
              /* 10 KHz values from I2C timing tool with clock 80 MHz */

              presc        = 0x0b;    /* PRESC - (+1) prescale I2CCLK */
              scl_l_period = 0xff;    /* SCLL - SCL low period in master mode */
              scl_h_period = 0xba;    /* SCLH - SCL high period in master mode */
              sda_delay    = 0x00;    /* SDADEL - (+1) data hold time after SCL falling edge */
              scl_delay    = 0x01;    /* SCLDEL - (+1) data setup time from SDA edge to SCL rising edge */
            }
        }
      else if (i2cclk_mhz == 120)
        {
          /*  The Speed and timing calculation are based on the following
           *  fI2CCLK = PCLK and is 120 MHz
           *  Analog filter is on,
           *  Digital filter off
           *  Rise Time is 120 ns and fall is 25 ns
           *  Mode is FastMode
           */

          if (frequency == 100000)
            {
              /* 100 KHz values from I2C timing tool with clock 120 MHz */

              presc        = 2;
              scl_delay    = 14;
              sda_delay    = 0;
              scl_h_period = 157;
              scl_l_period = 230;
            }
          else if (frequency == 400000)
            {
              /* 400 KHz values from I2C timing tool for clock of 120 MHz */

              presc        = 2;
              scl_delay    = 8;
              sda_delay    = 0;
              scl_h_period = 21;
              scl_l_period = 66;
            }
          else if (frequency == 1000000)
            {
              /* 1000 KHz values from I2C timing tool for clock of 120 MHz */

              presc        = 2;
              scl_delay    = 6;
              sda_delay    = 0;
              scl_h_period = 7;
              scl_l_period = 20;
            }
          else
            {
              /* 10 KHz values not supported */

              DEBUGPANIC();
            }
        }
      else if (i2cclk_mhz == 16)
        {
          /*  The Speed and timing calculation are based on the following
           *  fI2CCLK = HSI and is 16Mhz
           *  Analog filter is on,
           *  Digital filter off
           *  Rise Time is 120 ns and fall is 10ns
           *  Mode is FastMode
           */

          if (frequency == 100000)
            {
              presc        = 0;
              scl_delay    = 5;
              sda_delay    = 0;
              scl_h_period = 61;
              scl_l_period = 89;
            }
          else if (frequency == 400000)
            {
              presc        = 0;
              scl_delay    = 3;
              sda_delay    = 0;
              scl_h_period = 6;
              scl_l_period = 24;
            }
          else if (frequency == 1000000)
            {
              presc        = 0;
              scl_delay    = 2;
              sda_delay    = 0;
              scl_h_period = 1;
              scl_l_period = 5;
            }
          else
            {
              presc        = 7;
              scl_delay    = 0;
              sda_delay    = 0;
              scl_h_period = 35;
              scl_l_period = 162;
            }
        }
      else if (i2cclk_mhz == 48)
        {
          if (frequency == 100000)
            {
              presc        = 2;
              scl_delay    = 10;
              sda_delay    = 0;
              scl_h_period = 62;
              scl_l_period = 85;
            }
          else if (frequency == 400000)
            {
              presc        = 1;
              scl_delay    = 8;
              sda_delay    = 0;
              scl_h_period = 12;
              scl_l_period = 33;
            }
          else if (frequency == 1000000)
            {
              presc        = 0;
              scl_delay    = 5;
              sda_delay    = 0;
              scl_h_period = 8;
              scl_l_period = 22;
            }
        }
      else
        {
          DEBUGPANIC();
        }

      uint32_t timingr =
        (presc << I2C_TIMINGR_PRESC_SHIFT) |
        (scl_delay << I2C_TIMINGR_SCLDEL_SHIFT) |
        (sda_delay << I2C_TIMINGR_SDADEL_SHIFT) |
        (scl_h_period << I2C_TIMINGR_SCLH_SHIFT) |
        (scl_l_period << I2C_TIMINGR_SCLL_SHIFT);

